#+TITLE: texconvertr 開発ノート
#+PROPERTY: header-args :cache yes :exports code :results scalar
#+STARTUP: contents
#+BEGIN_SRC R :results silent
  setwd("texconvertr")
#+END_SRC


* 環境構築
#+BEGIN_SRC R :results silent
# devtools::create("texconvertr")
setwd("texconvertr")
usethis::use_testthat()
#+END_SRC

** 使用したパッケージ
#+BEGIN_SRC R
  setwd("texconvertr")
  usethis::use_package("magrittr", "Imports")
#+END_SRC


* 開発

** リロード & 自動テスト
#+BEGIN_SRC R :results output
  setwd("texconvertr")
  system("R CMD INSTALL --preclean --no-multiarch --with-keep.source .")
  devtools::load_all()
  devtools::test()
  devtools::document(roclets=c('rd', 'collate', 'namespace'))
#+END_SRC

#+RESULTS:
: No man pages found in package  ‘texconvertr’ 
: ✔ | OK F W S | Context
: ⠏ |  0       | convert data frame into LaTeX table⠋ |  1       | convert data frame into LaTeX table✔ |  1       | convert data frame into LaTeX table
: 
: ══ Results ═════════════════════════════════════════════════════════════════════
: OK:       1
: Failed:   0
: Warnings: 0
: Skipped:  0

** テスト
#+BEGIN_SRC R :tangle texconvertr/tests/testthat/test_convdf.R
  context("convert data frame into LaTeX table")

  test_that("make_header() makes header", {
    df <- data.frame(a = 1:3, b = 2:4)
    expect_equal(make_header(df), "a & b \\ \\hline")
  })
#+END_SRC
** 開発
#+BEGIN_SRC R :tangle texconvertr/R/convdf.R
  make_header <- function(df) {
    name <- paste(colnames(df), collapse = " & ")
    eor  <- "\\ \\hline"
    out  <- paste(name, eor)
    out
  }
#+END_SRC
